import constant

#r = радиус планеты в млн. км
#u = орбитальная скорость
# Первая планета
r = int(input('Введите радиус орбиты первой планеты, млн.км '))
u = int(input('Введите орбитальную скорость первой планеты, км,ч: '))
t1 = ((2 * r * 1000000) * float(constant.pi)) / (u * 24)
print(f"{t1:.4f}")

# Вторая планета
r1 = int(input('Введите радиус орбиты второй планеты, млн.км: '))
u1 = int(input('Введите орбитальную скорость второй планеты, км,ч: '))
t2 = ((2 * r1 * 1000000) * float(constant.pi)) / (u1 * 24)
print(f"{t2:.4f}")

print(t1 > t2)
