"""Написать лямбда-функцию определяющую чётное/нечётное"""


foo = lambda x = int(input('Введите число: ')): print('чётное') if x % 2 == 0 else print('нечётное')
foo()