#Ex. 1
#Создать список (list), содержащий числа, кратные 7 в диапазоне от 0 до 100.
#Выбрать первые 5 записей и записать в другой список с помощью среза.

a = []
b = []
for i in range(1,101):

    if i%7 == 0:
        a.append(i)
b = a[:5]
print(a, b, sep='\n')
