"""Ex.4
Ввести целое число N. Получить сумму кубов всех целых чисел от 1 до N (включая).
Реализовать через while и for.
"""
n_1 = int(input('Введите число n_1: '))
summ_1 = sum([x * x * x for x in range(1, n_1+1)])
print(f"Сумма кубов:  {summ_1}")



n_2 = int(input('Введите число n_2: '))
summ_2 = 0
while n_2 > 0:
    summ_2 += n_2 * n_2 * n_2
    n_2 -=1
print(f"Сумма кубов:  {summ_2}")
